# explicity არის როცა კომპიუტერს პირდაპირ ვუბრძანეთ რა გააკეთოს.
# implicity არის როცა კომპიუტერი თვითონ აკეთბს რაღაცას ჩვენი ბრძანების გარეშე.

name = "Lile"
age = 14

print("my name is " + name)
print("i am " + str(age) + " years old")

fav_number = 5
print(5 ** 5)

# if - "თუ". პროგრამა ამოწმებს თუ რაღაც მართალია მაშინ აკეთებს იმას რაც შიგნით წერია. მაგალითად:
x=5
if x > 0:
     print("რიცხვი დადებითია")

# elif ვიყენებთ მაშინ როცა გვინდა პროგრამამ სხვა შესაძლებელი ვარიანტებიც შეამოწმოს თუ პირველი არ გამოჩნდა სწორად. მაგალითად:
elif  x > 0:
      print("რიცხვი დადებითია")

# else-ი ყოველთვის ბოლო უნდა იყოს და არ უნდა ქონდეს პირობა (: შემდეგ არაფერი არ წერენ). მაგალითად:
else:
      print("რიცხვი უარყოფითი არ არის")