# Data conversion არის პროცესი როცა ერთი ტიპის მონაცემს ვაქცევთ სხვა ტიპად.ის გვჭირდება მაშინ როცა მონაცემთა ტიპი არ ემთხვევა იმას რაც გვსურს რომ პრიგრამამ გამოგვიტანოს.
# int() მნიშვნელობას მთელ რიცხვად აქცევს
# float() მნიშვნელობას ათწილად წიცხვად აქცევს
# str() მნიშვნელობას ტექსტად აქცევს

x = "25"
print(int(25)) # ტექსტს აქცევს მთელ რიცხვად
print(float(25)) # რიცხვს აქცევს ათწილადად
print(str(25)) #რიცხვი გახდა ტექსტი

print(int(102)) # 102
print(str(102)) # "102"
print(float(102)) #102.0

print(int(7)) # 7
print(float(7)) # 7.0
print(str(7)) # "7"

