let number = Numbrer(promt("Enter a number: "));
if (number > 50) {
    console.log("big");
} else if (25 < number < 50) {
    console.log("medium");
} else {
    console.log("small");
}

// if...else გამოიყენება მაშინ, როცა ბევრი პირობის შემოწმება.
// ternary operator არის if...else-ის მოკლე ფორმა. გამოიყენება მარტივი პირობებისთვის.
// switch case გამოიყენება მაშინ, როცა ერთ ცვლადს ვადარებთ ბევრ კონკრეტულ მნიშვნელობას


// რეკურსია არის ფუნქცია, რომელიც თავის თავს იძახებს. გამოიყენება მაშინ, როცა ამოცანა შეიძლება დაიშალოს პატარა იგივე ტიპის ამოცანებად.

/*
this მიუთითებს იმ ობიექტზე, რომელმაც მეთოდი გამოიძახა.
თუ ობიექტის სახელს (user.name) გამოვიყენებთ:
1) ობიექტის სახელის შეცვლისას კოდი გაფუჭდება
2) მეთოდი ვერ იქნება მრავალჯერ გამოყენებადი სხვა ობიექტებში
this-ის გამოყენება კოდს ხდის უსაფრთხოს
*/
