# int() არის ფუნქცია, რომელიც სხვა ტიპის მნიშვნელობას მთელ რიცხვად აქცევს.
print(int("15")) 
print(int(7.9))

a = int(input("10"))
b = int(input("20"))
c = int(input("30"))
d = int(input("40"))
e = int(input("50"))
print((10 + 20 + 30 + 40 + 50) / 5)

# string (str) მონაცემთა ტიპი, რომელშიც შედის  ნებისმიერი რამ რაც მოქცეულია ბრჭყალებში ---> "lile" / "dzneladze" /"200"
# integer (int) მონაცემთა ტიპი, რომელშიც შედის მხოლოდ მთელი რიცხვები ---> 1 /2 / 3 ... / 200 / 500 / 1000
# float მონაცემტა ტიპი, რომელშიც შედის მხოლოდ წილადი რიცხვები ---> 5.5 / 1.99 / 3.0