# string (str) მონაცემთა ტიპი, რომელშიც შედის  ნებისმიერი რამ რაც მოქცეულია ბრჭყალებში ---> "lile" / "dzneladze" /"200"
# integer (int) მონაცემთა ტიპი, რომელშიც შედის მხოლოდ მთელი რიცხვები ---> 1 /2 / 3 ... / 200 / 500 / 1000
# float მონაცემტა ტიპი, რომელშიც შედის მხოლოდ წილადი რიცხვები ---> 5.5 / 1.99 / 3.0

#print() - ფუნქცია, რომელსაც ფრჩხილებში გადავცემთ მონაცემს და კოდის გაშვების შემდეგ ეს მონაცემები დაიბეჭდება ტერმინალში (გამომიტანს შედეგს)

print("Lile Dzneladze")
print(13)

name = "Lile"
lastname = "Dzneladze"
print(name)
print(lastname)