# ალგორითმი არის რიგრიგობით ჩამოწერილი ნაბიჯები რომელიც ამოცანის სწორად ამოხსნაში გვეხმარება.
# sequencing არის რაღაცის შესრულება ისე როგორც არის მოცემული.
# iteration არის ერთი და იგივე მოქმედების გამეორება სანამ რაღაც პირობა არ შესრულდება.
# selection ეს არის გადაწყვეტილების მიღება. აი მაგალითად: თუ წვიმს აიღე ქოლგა, თუ არ წვიმს არ აიღებ.

# flowchart არის დიაგრამა, რომელიც აჩვენებს ალგორითმს ვიზუალურად.
# pseudocode არის ალგორითმის აღწერა ტექსტურად.
# natural language არის ალგორითმის ახსნა ჩვეულებრივი ენით ისე რომ ყველა ადამიანმა გაიგოს.

number1 = int(input(10))
number2 = int(input(20))
number3 = number1 + number2
print("number3")
